# Pandas GroupBy Operations

## Understanding GroupBy Object

In [15]:
import pandas as pd

In [17]:
dataset= pd.read_csv("Campus_Placement_Tracker_500.csv")

In [19]:
dataset.head()

,Roll Number,First Name,Last Name,Gender,Branch,Company,CTC (LPA),Job Role
0,22BCE6764,Shruti,Gupta,Female,Civil,Capgemini,3.43,Software Engineer
1,22BCE1856,Dev,Sharma,Male,Mechanical,Cognizant,5.63,Data Analyst
2,22BCE7769,Dev,Pandey,Male,ECE,TCS,4.17,Software Engineer
3,22BCE3591,Atharv,Mehta,Female,ECE,Infosys,3.42,DevOps Engineer
4,22BCE2533,Sai,Agarwal,Male,Civil,TCS,3.14,DevOps Engineer

In [21]:
dataset.tail()

,Roll Number,First Name,Last Name,Gender,Branch,Company,CTC (LPA),Job Role
495,22BCE9836,Aarav,Verma,Male,EEE,Google,21.62,Backend Developer
496,22BCE3684,Dev,Joshi,Female,Civil,Wipro,13.19,Data Analyst
497,22BCE3357,Ishaan,Reddy,Female,Civil,Google,12.04,DevOps Engineer
498,22BCE6715,Kritika,Kapoor,Male,IT,TCS,20.80,System Analyst
499,22BCE7062,Arjun,Kapoor,Male,Mechanical,Google,22.68,System Analyst

In [23]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Roll Number  500 non-null    object
 1   First Name   500 non-null    object
 2   Last Name    500 non-null    object
 3   Gender       500 non-null    object
 4   Branch       500 non-null    object
 5   Company      500 non-null    object
 6   CTC (LPA)    500 non-null    float64
 7   Job Role     500 non-null    object
dtypes: float64(1), object(7)
memory usage: 31.4+ KB

In [25]:
dataset_slice = dataset.iloc[:10,[3,6]]

In [27]:
dataset_slice

   Gender  CTC (LPA)
0  Female       3.43
1    Male       5.63
2    Male       4.17
3  Female       3.42
4    Male       3.14
5  Female       5.92
6  Female       4.41
7  Female       4.71
8    Male       4.93
9    Male       5.31

In [29]:
dataset_slice.groupby("Gender")

In [33]:
gbo = dataset_slice.groupby("Gender")

In [35]:
type(gbo)

pandas.core.groupby.generic.DataFrameGroupBy

In [37]:
gbo.groups

{'Female': [0, 3, 5, 6, 7], 'Male': [1, 2, 4, 8, 9]}

In [39]:
l=list(gbo)

In [41]:
l

[('Female',
     Gender  CTC (LPA)
  0  Female       3.43
  3  Female       3.42
  5  Female       5.92
  6  Female       4.41
  7  Female       4.71),
 ('Male',
    Gender  CTC (LPA)
  1   Male       5.63
  2   Male       4.17
  4   Male       3.14
  8   Male       4.93
  9   Male       5.31)]

In [43]:
len(l)

2

In [45]:
l[0]

('Female',
    Gender  CTC (LPA)
 0  Female       3.43
 3  Female       3.42
 5  Female       5.92
 6  Female       4.41
 7  Female       4.71)

In [47]:
type(l[0])

tuple

In [49]:
l[0][0]

'Female'

In [53]:
l[0][1]

   Gender  CTC (LPA)
0  Female       3.43
3  Female       3.42
5  Female       5.92
6  Female       4.41
7  Female       4.71

In [55]:
l[1]

('Male',
   Gender  CTC (LPA)
 1   Male       5.63
 2   Male       4.17
 4   Male       3.14
 8   Male       4.93
 9   Male       5.31)

In [57]:
dataset_slice.loc[dataset_slice.Gender=="Female"]

   Gender  CTC (LPA)
0  Female       3.43
3  Female       3.42
5  Female       5.92
6  Female       4.41
7  Female       4.71

In [63]:
dataset_slice_f = dataset_slice.loc[dataset_slice.Gender=="Female"]
dataset_slice_f

   Gender  CTC (LPA)
0  Female       3.43
3  Female       3.42
5  Female       5.92
6  Female       4.41
7  Female       4.71

In [65]:
dataset_slice_m = dataset_slice.loc[dataset_slice.Gender=="Male"]
dataset_slice_m

  Gender  CTC (LPA)
1   Male       5.63
2   Male       4.17
4   Male       3.14
8   Male       4.93
9   Male       5.31

In [67]:
dataset_slice_f.equals(l[0][1])

True

In [69]:
for element in gbo:
    print(element[1])

   Gender  CTC (LPA)
0  Female       3.43
3  Female       3.42
5  Female       5.92
6  Female       4.41
7  Female       4.71
  Gender  CTC (LPA)
1   Male       5.63
2   Male       4.17
4   Male       3.14
8   Male       4.93
9   Male       5.31